import logoImage from '../assets/logo.webp';

const AboutUs = () => {
    return (
        <div className="relative p-8 bg-primaryBg min-h-screen w-full">
            <a href="/" className="inline-block py-4 w-fit" title="Home">
                <img
                    alt="Home"
                    src={logoImage}
                    className="h-8 sm:h-10 md:h-10"
                />
            </a>
            <h2 className="text-3xl text-white font-bold font-serif ">AboutUs:</h2>
            <p
  dir="rtl"
  className="text-xl text-white font-serif mb-4 whitespace-pre-line text-right"
>
{`
سلام کاربر گرامی!  
من تصمیم گرفتم که در این بخش از سایت، به جای یک متن رسمی "درباره‌ی مای نمایشی"،
به‌طور خلاصه و به زبان ساده، قابلیت‌ها و امکانات این سایت را برای شما توضیح دهم:  

✅ نمایش فیلم‌ها و برنامه های تلوزیونی ترند روز  

✅ دسته‌بندی فیلم‌ها و برنامه های تلوزیونی بر اساس ژانر، دهه، یا ترکیبی از هر دو  

✅ جستجو در دیتابیس TMDB برای پیدا کردن فیلم‌ها و برنامه های تلوزیونی موردنظر  

✅ دسته‌بندی نتایج جستجو بر اساس ژانر، دهه، یا ترکیب این دو  

✅ دسترسی به جزئیات هر فیلم یا برنامه ی تلوزیونی با کلیک (Tap/Click) روی پوستر یا نام آن  

✅ امکان ثبت‌ نام، ورود و خروج کاربران در سایت  

✅ ثبت و مشاهده‌ی نظرات (Review) برای هر فیلم و برنامه ی تلوزیونی پس از ثبت‌ نام و ورود  

✅ افزودن فیلم‌ها و برنامه های تلوزیونی به لیست تماشا (Watchlist) برای کاربران ثبت‌ نام‌شده  

✅ دسترسی به صفحه‌ی اطلاعات فیلم‌ها و برنامه های تلوزیونی از طریق لیست تماشای شخصی (Watchlist)

و در آخر لازم دیدم که موضوع دیگری را به اطلاع شما بازدیدکننده ی محترم برسانم، و آن هم متاسفانه 
مشکلاتی هست که به دلیل وجود تحریم و ضعف اینترنت در ایران از سمت ابزار هایی مثل TMDB API که محتوای سایتم از طریق آن فراهم میشود 
در اواسط ساخت این پروژه به وجود امد و ممکن است برای بهره مندی کامل و راحت از محتوای سایت نیازمند یک VPN با IP 
معتبر شوید و چون این سایت یک نمونه کار است، امیدوارم که این مسئله باعث ایجاد سو تفاهم راجب مهارت های فنی بنده در زمینه ی توسعه ی وب نشود.
البته در حال حاضر، بدون VPN هم امکان تست کارآیی و عملکرد های سایت عموما فراهم هست، و از طرفی این
مشکلات هم فرم ثابت و همیشگی ندارند.
و در نهایت از وقتی که برای من و بررسی کارم اختصاص داده اید، کمال تشکر را دارم.
با آرزوی بهترین ها✨

`}
</p>


        </div>
    );
};

export default AboutUs;